tap "adoptopenjdk/openjdk"
tap "buo/cask-upgrade"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "sanemat/font"
brew "anyenv"
brew "bat"
brew "cask"
brew "composer"
brew "coreutils"
brew "docker"
brew "docker-compose"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "gist"
brew "git"
brew "gnupg"
brew "hub"
brew "hunspell"
brew "mas"
brew "pinentry-mac"
brew "vim"
brew "yarn"
brew "d12frosted/emacs-plus/emacs-plus"
brew "sanemat/font/ricty"
cask "adoptopenjdk14"
cask "appcleaner"
cask "boostnote"
cask "cheatsheet"
cask "docker"
cask "dropbox"
cask "font-hackgen"
cask "google-chrome"
cask "iterm2"
cask "kindle"
cask "openinterminal-lite"
cask "the-unarchiver"
cask "vagrant"
mas "Perculia", id: 1462633284
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835
