tap "adoptopenjdk/openjdk"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "keith/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "mutagen-io/mutagen"
tap "railwaycat/emacsmacport"
tap "sanemat/font"
tap "yt-dlp/taps"
brew "anyenv"
brew "autoconf"
brew "automake"
brew "bat"
brew "fmt"
brew "grpc"
brew "bear"
brew "bison"
brew "black"
brew "boost"
brew "pkg-config"
brew "cairo"
brew "carthage"
brew "cmake"
brew "libssh2"
brew "php"
brew "composer"
brew "coreutils"
brew "deno"
brew "dosfstools"
brew "doxygen"
brew "dvdbackup"
brew "exa"
brew "fd"
brew "gnutls"
brew "harfbuzz"
brew "mpg123"
brew "ffmpeg"
brew "flake8"
brew "gcc"
brew "gdb"
brew "ghostscript"
brew "ghq"
brew "gist"
brew "git"
brew "gnupg"
brew "gpgme"
brew "go"
brew "helm"
brew "hub"
brew "hugo"
brew "hunspell"
brew "imagemagick"
brew "intltool"
brew "isync"
brew "libxml2"
brew "python@3.10"
brew "itstool"
brew "jansson"
brew "jq"
brew "k3d"
brew "less"
brew "libgccjit"
brew "librsvg"
brew "libvterm"
brew "llvm"
brew "mailutils"
brew "make"
brew "mas"
brew "meson"
brew "msmtp"
brew "mupdf"
brew "nasm"
brew "netcat"
brew "nkf"
brew "node"
brew "offlineimap"
brew "p7zip"
brew "packer"
brew "pandoc"
brew "pinentry-mac"
brew "pipenv"
brew "poppler"
brew "pwgen"
brew "python@3.8"
brew "qemu"
brew "radare2"
brew "ripgrep"
brew "ripgrep-all"
brew "ruby"
brew "rust"
brew "s-search"
brew "shellcheck"
brew "shfmt"
brew "sphinx-doc"
brew "texinfo"
brew "the_silver_searcher"
brew "vim"
brew "wakatime-cli"
brew "weechat"
brew "wget"
brew "xapian"
brew "yarn"
brew "yq"
brew "keith/formulae/reminders-cli"
brew "yt-dlp/taps/yt-dlp"
cask "adobe-acrobat-reader"
cask "adoptopenjdk14"
cask "appcleaner"
cask "basictex"
cask "chatgpt"
cask "cheatsheet"
cask "dropbox"
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "font-jetbrains-mono"
cask "font-roboto-mono-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "kap"
cask "kindle"
cask "rar"
cask "sourcetrail"
cask "the-unarchiver"
cask "vagrant"
cask "visual-studio-code"
cask "vlc"
cask "wkhtmltopdf"
cask "xld"
mas "Amphetamine", id: 937984704
mas "Duplicate Photos Finder", id: 984929789
mas "Flacbox", id: 1594027432
mas "Just Press Record", id: 1033342465
mas "LINE", id: 539883307
mas "Perculia", id: 1462633284
mas "Prime Video", id: 545519333
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835
