tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "keith/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "mutagen-io/mutagen"
tap "railwaycat/emacsmacport"
tap "sanemat/font"
tap "yt-dlp/taps"
brew "anyenv"
brew "autoconf"
brew "automake"
brew "libssh2"
brew "bat"
brew "fmt"
brew "grpc"
brew "bear"
brew "bison"
brew "black"
brew "boost"
brew "cairo"
brew "carthage"
brew "cmake"
brew "php"
brew "composer"
brew "coreutils"
brew "cuetools"
brew "deno"
brew "dosfstools"
brew "doxygen"
brew "dvdbackup"
brew "exa"
brew "fd"
brew "flac"
brew "gnutls"
brew "harfbuzz"
brew "mpg123"
brew "ffmpeg"
brew "flake8"
brew "fzf"
brew "gcc"
brew "gdb"
brew "ghostscript"
brew "ghq"
brew "gist"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "gpgme"
brew "helm"
brew "hub"
brew "hugo"
brew "hunspell"
brew "imagemagick"
brew "intltool"
brew "isync"
brew "libxml2"
brew "itstool"
brew "jansson"
brew "jq"
brew "k3d"
brew "less"
brew "libgccjit"
brew "librsvg"
brew "libvterm"
brew "llvm"
brew "mailutils"
brew "make"
brew "mas"
brew "meson"
brew "msmtp"
brew "mupdf"
brew "nasm"
brew "netcat"
brew "nkf"
brew "node"
brew "offlineimap"
brew "openjdk"
brew "p7zip"
brew "packer"
brew "pandoc"
brew "pinentry-mac"
brew "pipenv"
brew "pkg-config"
brew "poppler"
brew "pwgen"
brew "python@3.10"
brew "python@3.8"
brew "qemu"
brew "radare2"
brew "ripgrep"
brew "ripgrep-all"
brew "ruby"
brew "rust"
brew "s-search"
brew "shellcheck"
brew "shfmt"
brew "shntool"
brew "sphinx-doc"
brew "texinfo"
brew "the_silver_searcher"
brew "tor"
brew "tree-sitter"
brew "vim"
brew "wakatime-cli"
brew "weechat"
brew "wget"
brew "xapian"
brew "yarn"
brew "yq"
brew "yt-dlp"
brew "keith/formulae/reminders-cli"
cask "adobe-acrobat-reader"
cask "appcleaner"
cask "basictex"
cask "calibre"
cask "chatgpt"
cask "cheatsheet"
cask "dropbox"
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "font-jetbrains-mono"
cask "font-roboto-mono-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "musicbrainz-picard"
cask "rar"
cask "the-unarchiver"
cask "vagrant"
cask "visual-studio-code"
cask "wkhtmltopdf"
cask "xld"
mas "Amphetamine", id: 937984704
mas "iMovie", id: 408981434
mas "Just Press Record", id: 1033342465
mas "Kindle", id: 302584613
mas "LINE", id: 539883307
mas "Prime Video", id: 545519333
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "gonzalovsilva.orgcolor"
vscode "googlecloudtools.cloudcode"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "redhat.vscode-yaml"
vscode "RomanPeshkov.vscode-text-tables"
vscode "salesforce.salesforce-vscode-slds"
vscode "salesforce.salesforcedx-vscode"
vscode "salesforce.salesforcedx-vscode-apex"
vscode "salesforce.salesforcedx-vscode-apex-debugger"
vscode "salesforce.salesforcedx-vscode-apex-replay-debugger"
vscode "salesforce.salesforcedx-vscode-core"
vscode "salesforce.salesforcedx-vscode-lightning"
vscode "salesforce.salesforcedx-vscode-lwc"
vscode "salesforce.salesforcedx-vscode-soql"
vscode "salesforce.salesforcedx-vscode-visualforce"
vscode "SeungukShin.org-code"
vscode "time-link.kleio"
vscode "time-link.timelink-snippets-ilhavo"
vscode "time-link.timelink-vscode-web"
vscode "tittoassini.vscode-planner"
vscode "tootone.org-mode"
vscode "valentjn.vscode-ltex"
vscode "vscode-org-mode.org-mode"
vscode "vscodevim.vim"
