tap "akicho8/shogi"
tap "laishulu/homebrew"
# Simple, modern, secure file encryption
brew "age"
# Asciicast to GIF converter
brew "agg"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Download with resuming and segmented downloading
brew "aria2"
# Record and share terminal sessions
brew "asciinema"
# Spell checker with better logic than ispell
brew "aspell"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Core application library for C
brew "glib"
# GNU multiple precision arithmetic library
brew "gmp"
# C library for multiple-precision floating-point computations
brew "mpfr"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Next-gen compiler infrastructure
brew "llvm"
# Run a SQL like language to perform queries on C/C++ files
brew "clangql"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Utilities for .cue and .toc files
brew "cuetools"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Message bus system, providing inter-application communication
brew "dbus"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# XML 1.0 parser
brew "expat"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Free lossless audio codec
brew "flac"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Library and utilities for processing GIFs
brew "giflib"
# GitHub command-line tool
brew "gh"
# Multi-platform software reverse engineering framework
brew "ghidra", link: false
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Language server for the Go language
brew "gopls"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Synchronize a maildir with an IMAP server
brew "isync"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# LaTeX to XML/HTML/MathML Converter
brew "latexml"
# Portable Foreign Function Interface library
brew "libffi"
# JIT library for the GNU compiler collection
brew "libgccjit"
# Conversion library
brew "libiconv"
# C library for files containing sampled sound
brew "libsndfile"
# GNOME XML library
brew "libxml2"
# Music engraving system
brew "lilypond"
# Access large language models from the command-line
brew "llm"
# Swiss Army knife of email handling
brew "mailutils"
# Mac App Store command-line interface
brew "mas"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# CLI for Mermaid library
brew "mermaid-cli", link: false
# Small build system for use with gyp or CMake
brew "ninja"
# Fast and user friendly build system
brew "meson"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# SMTP client that can be used as an SMTP plugin for Mutt
brew "msmtp"
# Lightweight PDF and XPS viewer
brew "mupdf"
# Text-based UI library
brew "ncurses"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Thread-based email index, search, and tagging
brew "notmuch"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Open source computer vision library
brew "opencv"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Python Language Server for the Language Server Protocol
brew "python-lsp-server"
# Python interface to Tcl/Tk
brew "python-tk@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Python interface to Tcl/Tk
brew "python-tk@3.11"
# Tool Command Language
brew "tcl-tk"
# Python interface to Tcl/Tk
brew "python-tk@3.14"
# Cross-platform application and UI framework
brew "qt"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Autoformat shell script source code
brew "shfmt"
# Multi-purpose tool for manipulating and analyzing WAV files
brew "shntool"
# SOund eXchange: universal sound sample translator
brew "sox"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Official documentation format of the GNU project
brew "texinfo"
# Parser generator tool
brew "tree-sitter-cli"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# Formatter for python code
brew "yapf"
# General-purpose lossless data-compression library
brew "zlib"
# Utility that prevents the system from going to sleep
cask "caffeine"
cask "font-cascadia-code-nf"
cask "font-fira-code"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono"
cask "font-jolly-lodger"
cask "font-meslo-for-powerlevel10k"
cask "font-noto-color-emoji"
cask "font-noto-sans-cjk"
cask "font-noto-sans-jp"
cask "font-noto-sans-symbols-2"
cask "font-roboto-mono-nerd-font"
cask "font-source-code-pro"
# Software reverse engineering (SRE) suite of tools
cask "ghidra"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Limitless clipboard
cask "paste"
# ShogiHome は Windows・macOS・Linux で動作する次世代のGUI将棋アプリです。
cask "akicho8/shogi/shogi-home"
# Quicklook extension for source files
cask "syntax-highlight"
# Virtual pet MMO
cask "webkinz"
mas "Amphetamine", id: 937984704
mas "Apollo", id: 6448019325
mas "Auto Scroll for Safari", id: 6745405563
mas "Bookmarks", id: 1590304377
mas "Command X", id: 6448461551
mas "CotEditor", id: 1024640650
mas "Declutter", id: 1574021257
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Just Press Record", id: 1033342465
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LINE", id: 539883307
mas "Numbers", id: 361304891
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Perplexity", id: 6714467650
mas "Prime Video", id: 545519333
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835
uv "aider-chat", with: ["pip"]
npm "@mermaid-js/mermaid-cli"
npm "@openai/codex"
npm "flow-bin"
